//============================================================
// 標頭檔
//============================================================
#include <iostream>
//============================================================
// 命名空間
//============================================================
using namespace std;
//============================================================
// 主程式
//============================================================
int main()
{
long long int iTours;		//旅行團人數
long long int iDays;		//待的日子
long long int iToursTemp;	//暫存旅行團人數

//Process
while (cin >> iTours >> iDays)
	{
	iToursTemp = iTours;
	while (iToursTemp < iDays)
		iToursTemp += ++iTours;
	cout << iTours << endl;
	}

return 0;
}
